{
    "data": [
      {
        "_id": "5114",
        "title": "Fullmetal Alchemist: Brotherhood",
        "alternativeTitles": [
          "Hagane no Renkinjutsushi: Fullmetal Alchemist",
          "Fullmetal Alchemist (2009)",
          "FMA",
          "FMAB",
          "鋼の錬金術師 FULLMETAL ALCHEMIST",
          "Fullmetal Alchemist: Brotherhood",
          "Fullmetal Alchemist Brotherhood"
        ],
        "ranking": 1,
        "genres": [
          "Action",
          "Adventure",
          "Drama",
          "Fantasy"
        ],
        "episodes": 64,
        "hasEpisode": true,
        "hasRanking": true,
        "image": "https://cdn.myanimelist.net/images/anime/1208/94745.jpg",
        "link": "https://myanimelist.net/anime/5114/Fullmetal_Alchemist__Brotherhood",
        "status": "Finished Airing",
        "synopsis": "After a horrific alchemy experiment goes wrong in the Elric household, brothers Edward and Alphonse are left in a catastrophic new reality. Ignoring the alchemical principle banning human transmutation, the boys attempted to bring their recently deceased mother back to life. Instead, they suffered brutal personal loss: Alphonse's body disintegrated while Edward lost a leg and then sacrificed an arm to keep Alphonse's soul in the physical realm by binding it to a hulking suit of armor.\n\nThe brothers are rescued by their neighbor Pinako Rockbell and her granddaughter Winry. Known as a bio-mechanical engineering prodigy, Winry creates prosthetic limbs for Edward by utilizing \"automail,\" a tough, versatile metal used in robots and combat armor. After years of training, the Elric brothers set off on a quest to restore their bodies by locating the Philosopher's Stone—a powerful gem that allows an alchemist to defy the traditional laws of Equivalent Exchange.\n\nAs Edward becomes an infamous alchemist and gains the nickname \"Fullmetal,\" the boys' journey embroils them in a growing conspiracy that threatens the fate of the world.\n\n[Written by MAL Rewrite]",
        "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1208/94745.jpg?s=7892d01b6c74f1bf945f7a3ff3bb1f6a",
        "type": "TV"
      },
      {
        "_id": "41467",
        "title": "Bleach: Sennen Kessen-hen",
        "alternativeTitles": [
          "Bleach: Thousand-Year Blood War Arc",
          "BLEACH 千年血戦篇",
          "Bleach: Thousand-Year Blood War"
        ],
        "ranking": 3,
        "genres": [
          "Action",
          "Adventure",
          "Fantasy"
        ],
        "episodes": 0,
        "hasEpisode": false,
        "hasRanking": true,
        "image": "https://cdn.myanimelist.net/images/anime/1764/126627.jpg",
        "link": "https://myanimelist.net/anime/41467/Bleach__Sennen_Kessen-hen",
        "status": "Not yet aired",
        "synopsis": "",
        "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1764/126627.jpg?s=196ea098ac1becd97fc0a4b50a949c2b",
        "type": "TV"
      },
      {
        "_id": "9253",
        "title": "Steins;Gate",
        "alternativeTitles": [
          "STEINS;GATE",
          "Steins;Gate"
        ],
        "ranking": 5,
        "genres": [
          "Drama",
          "Sci-Fi",
          "Suspense"
        ],
        "episodes": 24,
        "hasEpisode": true,
        "hasRanking": true,
        "image": "https://cdn.myanimelist.net/images/anime/1935/127974.jpg",
        "link": "https://myanimelist.net/anime/9253/Steins_Gate",
        "status": "Finished Airing",
        "synopsis": "Eccentric scientist Rintarou Okabe has a never-ending thirst for scientific exploration. Together with his ditzy but well-meaning friend Mayuri Shiina and his roommate Itaru Hashida, Rintarou founds the Future Gadget Laboratory in the hopes of creating technological innovations that baffle the human psyche. Despite claims of grandeur, the only notable \"gadget\" the trio have created is a microwave that has the mystifying power to turn bananas into green goo.\n\nHowever, when Rintarou decides to attend neuroscientist Kurisu Makise's conference on time travel, he experiences a series of strange events that lead him to believe that there is more to the \"Phone Microwave\" gadget than meets the eye. Apparently able to send text messages into the past using the microwave, Rintarou dabbles further with the \"time machine,\" attracting the ire and attention of the mysterious organization SERN.\n\nDue to the novel discovery, Rintarou and his friends find themselves in an ever-present danger. As he works to mitigate the damage his invention has caused to the timeline, he is not only fighting a battle to save his loved ones, but also one against his degrading sanity.\n\n[Written by MAL Rewrite]",
        "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1935/127974.jpg?s=cd8506e6d26bad48a78aa985477a55ca",
        "type": "TV"
      },
      {
        "_id": "38524",
        "title": "Shingeki no Kyojin Season 3 Part 2",
        "alternativeTitles": [
          "進撃の巨人 Season3 Part.2",
          "Attack on Titan Season 3 Part 2",
          "Attack on Titan Staffel 3 Teil 2",
          "Ataque a los Titanes Temporada 3 Parte 2",
          "L'Attaque des Titans Saison 3 Partie 2"
        ],
        "ranking": 6,
        "genres": [
          "Action",
          "Drama"
        ],
        "episodes": 10,
        "hasEpisode": true,
        "hasRanking": true,
        "image": "https://cdn.myanimelist.net/images/anime/1517/100633.jpg",
        "link": "https://myanimelist.net/anime/38524/Shingeki_no_Kyojin_Season_3_Part_2",
        "status": "Finished Airing",
        "synopsis": "Seeking to restore humanity's diminishing hope, the Survey Corps embark on a mission to retake Wall Maria, where the battle against the merciless \"Titans\" takes the stage once again.\n\nReturning to the tattered Shiganshina District that was once his home, Eren Yeager and the Corps find the town oddly unoccupied by Titans. Even after the outer gate is plugged, they strangely encounter no opposition. The mission progresses smoothly until Armin Arlert, highly suspicious of the enemy's absence, discovers distressing signs of a potential scheme against them. \n\nShingeki no Kyojin Season 3 Part 2 follows Eren as he vows to take back everything that was once his. Alongside him, the Survey Corps strive—through countless sacrifices—to carve a path towards victory and uncover the secrets locked away in the Yeager family's basement.\n\n[Written by MAL Rewrite]",
        "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1517/100633.jpg?s=4540a01b5883647ade494cd28392f100",
        "type": "TV"
      },
      {
        "_id": "39486",
        "title": "Gintama: The Final",
        "alternativeTitles": [
          "銀魂 THE FINAL",
          "Gintama: The Very Final",
          "N/A"
        ],
        "ranking": 8,
        "genres": [
          "Action",
          "Comedy",
          "Drama",
          "Sci-Fi"
        ],
        "episodes": 1,
        "hasEpisode": true,
        "hasRanking": true,
        "image": "https://cdn.myanimelist.net/images/anime/1988/113791.jpg",
        "link": "https://myanimelist.net/anime/39486/Gintama__The_Final",
        "status": "Finished Airing",
        "synopsis": "Two years have passed following the Tendoshuu's invasion of the O-Edo Central Terminal. Since then, the Yorozuya have gone their separate ways. Foreseeing Utsuro's return, Gintoki Sakata begins surveying Earth's ley lines for traces of the other man's Altana. After an encounter with the remnants of the Tendoshuu—who continue to press on in search of immortality—Gintoki returns to Edo.\n\nLater, the regrouped Shinsengumi and Yorozuya begin an attack on the occupied Central Terminal. With the Altana harvested by the wreckage of the Tendoshuu's ship in danger of detonating, the Yorozuya and their allies fight their enemies while the safety of Edo—and the rest of the world—hangs in the balance. Fulfilling the wishes of their teacher, Shouyou Yoshida's former students unite and relive their pasts one final time in an attempt to save their futures.\n\n[Written by MAL Rewrite]\n",
        "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1988/113791.jpg?s=e12ba155fe4a7beff571a5010d8214b2",
        "type": "Movie"
      },
      {
        "_id": "11061",
        "title": "Hunter x Hunter (2011)",
        "alternativeTitles": [
          "HxH (2011)",
          "HUNTER×HUNTER（ハンター×ハンター）",
          "Hunter x Hunter",
          "Hunter x Hunter",
          "Hunter x Hunter",
          "Hunter X Hunter"
        ],
        "ranking": 10,
        "genres": [
          "Action",
          "Adventure",
          "Fantasy"
        ],
        "episodes": 148,
        "hasEpisode": true,
        "hasRanking": true,
        "image": "https://cdn.myanimelist.net/images/anime/1337/99013.jpg",
        "link": "https://myanimelist.net/anime/11061/Hunter_x_Hunter_2011",
        "status": "Finished Airing",
        "synopsis": "Hunters devote themselves to accomplishing hazardous tasks, all from traversing the world's uncharted territories to locating rare items and monsters. Before becoming a Hunter, one must pass the Hunter Examination—a high-risk selection process in which most applicants end up handicapped or worse, deceased.\n\nAmbitious participants who challenge the notorious exam carry their own reason. What drives 12-year-old Gon Freecss is finding Ging, his father and a Hunter himself. Believing that he will meet his father by becoming a Hunter, Gon takes the first step to walk the same path.\n\nDuring the Hunter Examination, Gon befriends the medical student Leorio Paladiknight, the vindictive Kurapika, and ex-assassin Killua Zoldyck. While their motives vastly differ from each other, they band together for a common goal and begin to venture into a perilous world.\n\n[Written by MAL Rewrite]\n\n",
        "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1337/99013.jpg?s=1838e905a0aa3542a009fbcf78000701",
        "type": "TV"
      },
      {
        "_id": "820",
        "title": "Ginga Eiyuu Densetsu",
        "alternativeTitles": [
          "LoGH",
          "LotGH",
          "Gin'eiden",
          "GinEiDen",
          "Heldensagen Vom Kosmosinsel",
          "銀河英雄伝説",
          "Legend of the Galactic Heroes",
          "Les Héros de la Galaxie"
        ],
        "ranking": 11,
        "genres": [
          "Drama",
          "Sci-Fi"
        ],
        "episodes": 110,
        "hasEpisode": true,
        "hasRanking": true,
        "image": "https://cdn.myanimelist.net/images/anime/13/13225.jpg",
        "link": "https://myanimelist.net/anime/820/Ginga_Eiyuu_Densetsu",
        "status": "Finished Airing",
        "synopsis": "The 150-year-long stalemate between the two interstellar superpowers, the Galactic Empire and the Free Planets Alliance, comes to an end when a new generation of leaders arises: the idealistic military genius Reinhard von Lohengramm, and the FPA's reserved historian, Yang Wenli.\n\nWhile Reinhard climbs the ranks of the Empire with the aid of his childhood friend, Siegfried Kircheis, he must fight not only the war, but also the remnants of the crumbling Goldenbaum Dynasty in order to free his sister from the Kaiser and unify humanity under one genuine ruler. Meanwhile, on the other side of the galaxy, Yang—a strong supporter of democratic ideals—has to stand firm in his beliefs, despite the struggles of the FPA, and show his pupil, Julian Mintz, that autocracy is not the solution.\n\nAs ideologies clash amidst the war's many casualties, the two strategic masterminds must ask themselves what the real reason behind their battle is.\n\n[Written by MAL Rewrite]",
        "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/13/13225.jpg?s=385cedad342e284c5765833ab1cddc1c",
        "type": "OVA"
      },
      {
        "_id": "42938",
        "title": "Fruits Basket: The Final",
        "alternativeTitles": [
          "Fruits Basket 3rd Season",
          "Fruits Basket (2019) 3rd Season",
          "Furuba",
          "フルーツバスケット The Final",
          "Fruits Basket: The Final Season",
          "Fruits Basket Staffel 3",
          "Fruits Basket: The Final Season",
          "Fruits Basket Saison 3"
        ],
        "ranking": 12,
        "genres": [
          "Drama",
          "Romance",
          "Supernatural"
        ],
        "episodes": 13,
        "hasEpisode": true,
        "hasRanking": true,
        "image": "https://cdn.myanimelist.net/images/anime/1085/114792.jpg",
        "link": "https://myanimelist.net/anime/42938/Fruits_Basket__The_Final",
        "status": "Finished Airing",
        "synopsis": "Hundreds of years ago, the Chinese Zodiac spirits and their god swore to stay together eternally. United by this promise, the possessed members of the Souma family shall always return to each other under any circumstances. Yet, when these bonds shackle them from freedom, it becomes an undesirable burden—a curse. As head of the clan, Akito is convinced that he shares a special connection with the other Soumas. While he desperately clings to this fantasy, the rest of the family remains isolated and suppressed by the fear of punishment.\n\nTooru Honda, who has grown attached to the Soumas, is determined to break the chains that bind them. Her companionship with the family and her friends encourages her to move forward with lifting the curse. However, due to confounding revelations, she struggles to find the tenacity to continue her endeavors. With time slowly withering away, Tooru contends with an uncertain future in hopes of reaching the tranquility that may lie beyond all this commotion.\n\n[Written by MAL Rewrite]",
        "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1085/114792.jpg?s=bb4303c0804c9d5ca9fcb30b8f8e6783",
        "type": "TV"
      },
      {
        "_id": "35180",
        "title": "3-gatsu no Lion 2nd Season",
        "alternativeTitles": [
          "Sangatsu no Lion Second Season",
          "3月のライオン 第2シリーズ",
          "March Comes In Like A Lion 2nd Season",
          "March Come in Like a Lion Staffel 2",
          "March Comes in like a Lion Temporada 2",
          "March Comes in like a Lion Saison 2"
        ],
        "ranking": 14,
        "genres": [
          "Drama",
          "Slice of Life"
        ],
        "episodes": 22,
        "hasEpisode": true,
        "hasRanking": true,
        "image": "https://cdn.myanimelist.net/images/anime/3/88469.jpg",
        "link": "https://myanimelist.net/anime/35180/3-gatsu_no_Lion_2nd_Season",
        "status": "Finished Airing",
        "synopsis": "Now in his second year of high school, Rei Kiriyama continues pushing through his struggles in the professional shogi world as well as his personal life. Surrounded by vibrant personalities at the shogi hall, the school club, and in the local community, his solitary shell slowly begins to crack. Among them are the three Kawamoto sisters—Akari, Hinata, and Momo—who forge an affectionate and familial bond with Rei. Through these ties, he realizes that everyone is burdened by their own emotional hardships and begins learning how to rely on others while supporting them in return. \n\nNonetheless, the life of a professional is not easy. Between tournaments, championships, and title matches, the pressure mounts as Rei advances through the ranks and encounters incredibly skilled opponents. As he manages his relationships with those who have grown close to him, the shogi player continues to search for the reason he plays the game that defines his career.\n\n[Written by MAL Rewrite]",
        "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/3/88469.jpg?s=becfbf556902bc3501e06a07354b9d76",
        "type": "TV"
      },
      {
        "_id": "4181",
        "title": "Clannad: After Story",
        "alternativeTitles": [
          "CLANNAD〜AFTER STORY〜 クラナド アフターストーリー",
          "Clannad ~After Story~",
          "Clannad ~After Story~",
          "Clannad ~After Story~",
          "Clannad ~After Story~"
        ],
        "ranking": 16,
        "genres": [
          "Drama",
          "Romance",
          "Supernatural"
        ],
        "episodes": 24,
        "hasEpisode": true,
        "hasRanking": true,
        "image": "https://cdn.myanimelist.net/images/anime/1299/110774.jpg",
        "link": "https://myanimelist.net/anime/4181/Clannad__After_Story",
        "status": "Finished Airing",
        "synopsis": "Clannad: After Story, the sequel to the critically acclaimed slice-of-life series Clannad, begins after Tomoya Okazaki and Nagisa Furukawa graduate from high school. Together, they experience the emotional rollercoaster of growing up. Unable to decide on a course for his future, Tomoya learns the value of a strong work ethic and discovers the strength of Nagisa's support. Through the couple's dedication and unity of purpose, they push forward to confront their personal problems, deepen their old relationships, and create new bonds.\n\nTime also moves on in the Illusionary World. As the plains grow cold with the approach of winter, the Illusionary Girl and the Garbage Doll are presented with a difficult situation that reveals the World's true purpose.\n\nBased on the visual novel by Key and produced by Kyoto Animation, Clannad: After Story is an impactful drama highlighting the importance of family and the struggles of adulthood.\n\n[Written by MAL Rewrite]",
        "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1299/110774.jpg?s=fcd9db2cfd72c10a2278f483173cfff9",
        "type": "TV"
      }
    ],
    "meta": {
      "page": 1,
      "size": 10,
      "totalData": 5377,
      "totalPage": 538
    }
  }